// pages/Q&A/Q&A.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    activeNames: ['0'],
    showDateInfo:[
      {'title':'冷冻红肉','time':'10-12个月','dec':'一般包括猪、牛、羊肉，保质期在10-12个月，其中牛肉可以保存的比其他肉类时间长。',pic:'https://img2.baidu.com/it/u=3867785522,4014496463&fm=253&fmt=auto&app=138&f=JPEG?w=600&h=400'},
      {'title':'冷冻禽肉','time':'8-10个月','dec':'一般包括鸡、鸭、鹅、鸽肉等。',pic:'https://img1.baidu.com/it/u=3799352822,3418143066&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500'},
      {'title':'冷冻海、河鲜','time':'4个月','dec':'最长保质期可以半年内食用，但最好在4个月内食用。',pic:'https://img0.baidu.com/it/u=1160720294,3769454084&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=334'},
      {'title':'冷冻蔬菜','time':'5个月','dec':'少部分蔬菜可以冷冻保存，如玉米、板栗、豆类等',pic:'https://img1.baidu.com/it/u=3188061354,1555168362&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500'},
      {'title':'速冻主食','time':'1-2个月','dec':'即市面上常见的饺子、包子、汤圆等。',pic:'https://img2.baidu.com/it/u=4215496990,1473077366&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=295'},
      {'title':'新鲜肉食','time':'2-7天','dec':'鱼、牛肉、猪肉和禽肉等新鲜肉食冷藏时间不要超过两天。肉末买回家后，应尽快做成食品。熟肉冷藏时间稍长些，但是最好一周内吃完。熟猪排应该在三天内吃完，非冷冻的火腿、熏肉或腊肉的保质期最多1周。',pic:'https://img0.baidu.com/it/u=674201722,1438967596&fm=253&fmt=auto&app=138&f=JPEG?w=499&h=500'},
      {'title':'调味品','time':'3个月—1年','dec':'番茄酱保质期为8—12个月，蛋黄酱可保存6个月，调味品可在冰箱中保质1年，芥末在冰箱中可保质8个月。沙拉酱可储存9个月，酱油开启后最好3个月用完，黄油可冷藏1年不变质，果酱保质期一般为1年。',pic:'https://img0.baidu.com/it/u=1433294155,3129943579&fm=253&fmt=auto&app=120&f=JPEG?w=640&h=480'},
      {'title':'煮熟的蔬菜和谷类','time':'3-7天','dec':'蔬菜煮熟后保质期更短，熟的西兰花放入冰箱别超过三天。米饭、高汤及剩菜在冰箱中放置时间不可超过一周。',pic:'https://img2.baidu.com/it/u=3139386551,1817489003&fm=253&fmt=auto&app=138&f=JPEG?w=891&h=500'},
      {'title':'冷藏乳制品','time':'7天','dec':'马口铁罐装密封充氮包装为24个月，非充氮包装为12个月，玻璃瓶装为9个月，塑料袋装为6个月。',pic:'https://img2.baidu.com/it/u=395009624,2480083697&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500'},
      {'title':'食用油','time':'3个月','dec':'通常的保质日期是18个月，这是以包装未开封为前提的。开封后食用油的保质期会相应缩短，最好3个月内食用完。',pic:'https://img0.baidu.com/it/u=312473276,3305000437&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500'},
      {'title':'米面','time':'6-12个月','dec':'米面的保质期常温下是6个—12个月不等。如果在北方，只要不放在高温潮湿的地方，储藏条件也正常，可以延长到24个月，但米面一旦发霉，绝不可食用',pic:'https://img0.baidu.com/it/u=640709528,1955210155&fm=253&fmt=auto&app=138&f=JPEG?w=667&h=500'},
      {'title':'糕点','time':'1-7天','dec':'一般冬天7天，春季3天—5天，夏季1天—2天。因为含有水分，如果保存不当，面包糕点也许隔天就会发霉，一旦发霉，必须弃食。',pic:'https://img1.baidu.com/it/u=3282547272,3592899126&fm=253&fmt=auto&app=138&f=JPEG?w=750&h=500'},
      {'title':'蛋','time':'3-5周','dec':'没有固定的保质期，3周—5周内一般都是没有问题的，但蛋类每过一个星期，质量就会下降一个等级，必须尽快使用。',pic:'https://img1.baidu.com/it/u=2731938216,2467823323&fm=253&fmt=auto&app=138&f=JPEG?w=565&h=500'},
      {'title':'麦乳精','time':'3-12个月','dec':'锡铁罐装为12个月，玻璃瓶装为9个月，塑料袋装为3个月。',pic:'https://img1.baidu.com/it/u=2372131452,2338923666&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500'},
      {'title':'酒水','time':'1-7天','dec':'一般冬天7天，春季3天—5天，夏季1天—2天。因为含有水分，如果保存不当，面包糕点也许隔天就会发霉，11-12度熟啤酒省优以上为4个月，普通为2个月；14度啤酒为3个月；10.5度熟啤酒为50天，葡萄酒、果酒为6个月，汽酒为3个月，瓶装黄酒暂定为3个月，露酒为6个月。红葡萄酒在阴暗凉爽处可储藏几十年，但是一旦开启，葡萄酒最好放入冰箱储存。朗姆酒、杜松子酒、伏特加、威士忌和白兰地则没有保质期限制。一旦发霉，必须弃食。',pic:'https://img2.baidu.com/it/u=2549317924,3387879154&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=400'},
      {'title':'饼干','time':'1-3个月','dec':'镀锡铁罐装为3个月，塑料袋装为2个月，散装为1个月。',pic:'https://img2.baidu.com/it/u=410628420,3086780157&fm=253&fmt=auto&app=138&f=PNG?w=688&h=500'},
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },
  onChange(event) {
    this.setData({
      activeNames: event.detail,
    });
  },
  

})